class CardData {
  final int idCard;
  final String cardName;
  final String frontCard;
  final String backCard;
  final String detailCard;

CardData({required this.idCard,required this.cardName ,required this.detailCard,required this.backCard,required this.frontCard});
}

  final allData = [
    CardData(
        idCard: 1,
        cardName: "the Fool",
        detailCard:
            "ไพ่ใบนี้แม้หมอดูส่วนใหญ่จะแปลไม่ค่อยดีนัก แต่ผมมองว่า ไพ่ใบนี้ค่อนข้างดี มีอิสระที่จะคิด อิสระที่จะรัก คนที่ได้ไพ่ประจำตัวใบนี้ จึงเป็นคนที่มองโลกในแง่ดี พร้อมที่จะเผชิญปัญหาที่อาจจะหนักหน่วง เพื่อสิ่งที่เรารัก และอาจหมายถึงคนที่ยังรักอิสระอยู่ก็ได้",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theFool.png"),
    CardData(
        idCard: 2,
        cardName: "the Magician",
        detailCard:
            "ไพ่ใบนี้ถ้ามองในมุมมองความสัมพันธ์ ถือว่าเป็นไพ่ที่ดีมากใบนึงครับ หมายถึงความรัก ความสัมพันธ์ที่จักรวาลเปิดทางให้ ยังไงยังงั้น เพราะทุกอย่างดูจะดีไปหมดในทุกๆด้าน ทั้งอารมณ์และความคิด หากมีความไม่เข้าใจกันก็จะทำการปรับความเข้าใจกันได้อย่างดี",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theMagiccian.png"),
    CardData(
        idCard: 3,
        cardName: "the High Priestess",
        detailCard:
            "ในด้านความรัก ไพ่ใบนี้หมายถึงความสัมพันธ์ที่ซับซ้อน ไม่ชัดเจน มีความลังเล และรู้สึกลึกๆถึงบางอย่างที่ทำให้เราไม่สามารถก้าวต่อไปตรงๆได้ จึงทำให้บางทีภายนอกขัดแย้งกับภายใน เช่น การกระทำเหมือนเป็นแฟนกัน แต่จริงๆไม่ได้เป็นอะไรกัน หรือ ปากบอกไม่คิดอะไร แต่จริงๆก็คิด ขึ้นๆลงๆเหมือนพระจันทร์ที่เปลี่ยนรูปร่างไปตลอดเดือน",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theHighPriestess.png"),
    CardData(
        idCard: 4,
        cardName: "The Empress",
        detailCard:
            "ไพ่ใบนี้ความหมายในด้านความรักค่อนข้างดีทีเดียวครับ เป็นความรักที่อุดมสมบูรณ์ ราบรื่น เรียกได้ว่าพร้อมให้กำเนิดสิ่งใหม่ๆชื่นมื่นโดยเฉพาะถ้าเป็นไพ่แทนตัวผู้หญิงด้วยแล้ว มันหมายถึงว่า อีกฝ่ายนั้นมอบใจและกายให้คุณจนหมด โดยที่คุณไม่ได้ควบคุมอะไร เค้ามองคุณเหมือน จักรพรรดินี ที่อยู่สูงทีเดียว จะเสียก็แต่บางทีเค้าอาจจะมองคุณอยู่สูงเกินไป แต่คุณก็ดูแลเค้าได้เป็นอย่างดี",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theEmpress.png"),
    CardData(
        idCard: 5,
        cardName: "the Emperor",
        detailCard:
            "ไพ่ใบนี้เป็นไพ่ที่บ่งบอกถึงความรักที่ดี มั่นคง แต่ความรักความสัมพันธ์ก็อาจจะดูนิ่งๆซักหน่อย อาจไม่หวาน ไม่โรแมนติกนัก แต่ก็จริงจังและชัดเจน แต่ความสัมพันธ์ส่วนใหญ่ถ้าดูจะกลายเป็น ฝ่ายชายเป็นคนควบคุม ยกเว้น ฝ่ายหญิงจะมีไพ่ Empress ขึ้นแทนตำแหน่งตัวเอง ก็อาจจะออกแนวพ่อบ้านใจกล้าได้",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theEmperor.png"),
    CardData(
        idCard: 6,
        cardName: "the Hierophant",
        detailCard:
            "ไพ่ใบนี้ในด้านความรัก หมายถึงการมีข้อตกลงซึ่งกันและกัน ต่างฝ่ายที่ต่างมีวิธีคิด แนวคิดในความสัมพันธ์ที่ต่างกัน มาคุยกันเพื่อตกลงแนวคิดด้านความสัมพันธ์ร่วมกัน เช่น ตกลงว่าจะรักกันแบบเป็นแฟนกัน ตกลงกันว่าเป็นแค่เพื่อนกัน ตกลงกันว่าเราจะคบกันแบบไม่มีความสัมพันธ์ที่ชัดเจน",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theHierophant.png"),
    CardData(
        idCard: 7,
        cardName: "the Lovers",
        detailCard:
            "ไพ่ใบนี้จากชื่อไพ่ก็จะดูเน้นเรื่องความรักโดยตรงอยู่แล้วโดยตัวของมัน เป็นไพ่แห่งพรหมลิขิตที่ทำให้เราได้พบเจอคนที่ใช่ เข้ากันได้ดี มีความชอบซึ่งกันและกัน เหมือนมีด้ายแดงแห่งพรหมลิขิตผูกคนสองคนไว้ ไพ่เหมือนจะดีทุกอย่างในด้านความรัก เพียงแต่ว่า มันมีจุดที่เป็น ทางเลือกแน่นอนว่าไพ่ใบนี้พอเป็นทางเลือก ก็เหมือนเป็นจุดที่เรายังตัดสินใจไม่ได้ ยังลังเลตัดสินใจยาก",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theLover.png"),
    CardData(
        idCard: 8,
        cardName: "the Chariot",
        detailCard:
            "ในทางความรักไพ่ใบนี้ เป็นได้ทั้งดีและไม่ดี ขึ้นกับไพ่รอบๆและบริบทในความสัมพันธ์  แต่หลักๆคือการมุทะลุ ใช้ความมุ่งมั่นเดินหน้าในความสัมพันธ์ อาจแปลได้ในหลายๆแบบ เช่น เค้าไม่สนใจคุณ แต่คุณก็ยังตั้งใจเดินหน้าจีบต่อไป คู่รักที่เข้ากันไม่ได้ แต่ก็ยังฝืนๆคบกันต่อไป คนที่เลิกกันก็มีความมุ่งมั่นที่จะเดินหน้าจากกันไปในเส้นทางที่ตัดสินใจแล้ว",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theChariot.png"),
    CardData(
        idCard: 9,
        cardName: "Strangth",
        detailCard:
            "ไพ่ใบนี้ในด้านความรัก ก็ถือเป็นความรักที่เข้มแข็งและไม่แพ้อุปสรรคอะไรง่ายๆ ถ้าหากมีการทะเลาะเบาะแว้งกันก็สามารถควบคุมอารมณ์และเข้าใจกันได้ง่าย สามารถพัฒนาเป็นความสัมพันธ์ระยะยาวที่ดีได้อีกด้วยครับ",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/strangth.png"),
    CardData(
        idCard: 10,
        cardName: "the Hermit",
        detailCard:
            "ไพ่ใบนี้ด้านความรัก ส่วนใหญ่จะแปลถึงความโสด ถ้าถามว่าคนๆนั้นมีใครรึยัง คิดยังไง ก็อาจหมายความได้ว่า เค้าโสด เค้ายังไม่อยากมีใคร หรือไม่เค้ายังออกค้นหาตัวเอง ยังออกไปตามเป้าหมายของชีวิตอยู่ถ้าเป็นความรักที่เป็นเป็นคู่รัก หรือเป็นแฟนกันแล้วอาจหมายความว่า ความรักเริ่มถดถอย ความรู้สึกต่างๆเริ่มหายไป จนน่าจะออกห่างกันซักพัก",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theHermit.png"),
    CardData(
        idCard: 11,
        cardName: "Wheel OF Fortune",
        detailCard:
            "เหมือนโชคชะตากำลังเปลี่ยนแปลงแล้ว ความสัมพันธ์ของคุณจะเปลี่ยนแปลงซึ่งคุณก็อาจจะคาดไม่ถึงถ้าถามว่าเปลี่ยนไปดีมั้ย โดยส่วนใหญ่ไพ่ใบนี้จะแปลว่า โชคดี ดังนั้นจึงหมายถึงความโชคดีในด้านความรัก โชคชะตาได้หมุนให้ความสัมพันธ์ของคุณไปในทางที่ดีแล้ว",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/wheelOfFortune.png"),
    CardData(
        idCard: 12,
        cardName: "Justice",
        detailCard:
            "ความรักของไพ่ใบนี้ ก็จะเน้นไปที่ความเท่าเทียม การตัดสินใจด้วยเหตุผล มีการแลกเปลี่ยนความรักกันอย่างเท่าเทียม อาจมองได้ทั้งดีไม่ดี แต่ถ้าใบนี้ขึ้นย่อมหมายถึงสิ่งที่ดีกับเราแน่นอน เพราะมันเป็นการตัดสินใจที่มีเหตุผล เช่น เค้ารักเรา เรารักเค้า เราทำเพื่อเค้า เค้าก็ทำเพื่อเรา จะมีความเท่าเทียมในความรัก เค้าไม่สนใจเรา ความสัมพันธ์ที่เราให้ฝ่ายเดียว ถ้าไพ่ใบนี้ขึ้นก็จะหมายความว่า เราเริ่มตัดสินใจแล้วล่ะว่า เรายังโอเคมั้ย",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/justice.png"),
    CardData(
        idCard: 13,
        cardName: "the Hanged Man",
        detailCard:
            "ความรักของไพ่ใบนี้ออกจะเป็นแนว ถ้าคบกันอยู่ก็จะเป็นการเสียสละ ยอมทน เพื่อความสัมพันธ์จะได้ดำเนินต่อไป เช่น ความรักข้างเดียว ความรักที่เค้าไม่ชอบตอบ ความไม่ชัดเจน หรือความรักที่เป็นแฟนกันแล้วอีกฝ่ายมีข้อเสียมากมาย แล้วเราก็พร้อมที่จะรักและอยู่กับเค้าคนนั้นได้ แม้จะทรมาน แต่ก็โอเค",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theHangedMan.png"),
    CardData(
        idCard: 14,
        cardName: "the Death",
        detailCard:
            "ไพ่ใบนี้มักหมายถึงการเปลี่ยนแปลงในความสัมพันธ์ เป็นการจบสถานะบางอย่างไปสู่สถานะใหม่ แน่นอนว่าเป็นความหมายที่ดี หรือไม่ดีก็ได้ครับ",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/death.png"),
    CardData(
        idCard: 15,
        cardName: "temperance",
        detailCard:
            "ไพ่ใบนี้ในด้านความรักจะหมายถึง การที่เราหา สมดุลในความสัมพันธ์ เช่น บางทีเราความรู้สึกอาจมากเกินไป การกระทำอาจจะมากเกินไป ทำให้อีกฝ่ายอึดอัด เราก็จะต้องถอยออกมาค่อยๆเป็นค่อยๆไป ทดลองปรับตัวให้อยู่ตรงกลาง ให้ความสัมพันธ์ดำเนินไปได้ด้วยดี",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/temperrance.png"),
    CardData(
        idCard: 16,
        cardName: "the Devil",
        detailCard:
            "โดยปกติไพ่ใบนี้ ถ้าแปลกันในหลายๆที่จะแปลถึง การมีชู้ การรักสามเส้า การนอกใจ การผิดศีล การโกหกหลอกลวง อันที่จริงที่แปลอย่างนี้เพราะไพ่มีความหมายถึงการหลงมัวเมา ดังนั้นก็เป็นไปได้ว่าจะไปหลงคนอื่น ซึ่งจริงๆมันก็เป็นไปได้ว่า เค้ามีสิ่งที่เค้าหลงใหลมากกว่าคุณ เช่น งาน กีฬา เกมส์ ก็เป็นได้",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theDevil.png"),
    CardData(
        idCard: 17,
        cardName: "the Tower",
        detailCard:
            "ไพ่ใบนี้ในมุมมองความรัก ก็จะเป็นอะไรที่เรียกได้ว่า การเปลี่ยนแปลงกระทันหันความสัมพันธ์ก็อาจจะเปลี่ยนแปลงไปในทางที่ดีขึ้น หรือทางที่ไม่ดีก็ได้ แล้วแต่ไพ่ประกอบอื่นๆและสถานการณ์เป็นหลักครับ",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theTower.png"),
    CardData(
        idCard: 18,
        cardName: "the Star",
        detailCard:
            "ด้านความรักไพ่ใบนี้ บ่งบอกถึงความหวัง ในสิ่งใหม่ๆ โดยเฉพาะถ้าเป็นความสัมพันธ์ที่พึ่งเริ่มต้นใหม่ ก็จะเป็นความสัมพันธ์ที่ดีและสมหวังได้ตามแสงของดาวถ้าเป็นในความสัมพันธ์ที่ไม่ดีหรือที่ผ่านมาความสัมพันธ์ค่อนข้างจะแย่ ไพ่ใบนี้ก็จะหมายความว่า ถึงเวลาแล้วที่เราจะต้อง ฟื้นฟูรักษาตัวเองให้ดี เพราะความสดใส ความหวังใหม่ๆ กำลังรอคอยเราอยู่ข้างหน้า หรือถ้าใครที่เจ็บมาก่อน เจ็บมาเยอะ อกหักมา ก็อาจจะเป็นช่วงเวลาที่ยังไม่คิดจะเริ่มอะไรที่วุ่นวายตอนนี้ ยังอยากจะรักษาตัวเอง รักษาบาดแผลให้หายดีซะก่อน",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theStar.png"),
    CardData(
        idCard: 19,
        cardName: "the Moon",
        detailCard:
            "ไพ่ใบนี้ในเชิงความรัก ค่อนข้างเป็นไพ่ที่อ่อนไหวจริงๆ มันมีบางอย่างที่ผุดเปิดเผยขึ้นมาในความสัมพันธ์ เช่น เราไปรับรู้อะไรบางอย่างเกี่ยวกับเค้า ที่ทำให้เรารู้สึกไม่มั่นคง ซึ่งจริงๆมันอาจจะไม่ได้เป็นอย่างนั้นก็ได้ (เนื่องจากไพ่เป็นเพียงแค่แสงสลัว บางทีเราแค่ได้รับข่าวบางอย่าง เราก็มโนไปต่างๆนานา) หรือแม้แต่บางอย่างที่เราเก็บไว้ในใจ ความรู้สึกที่เราเก็บไว้ในใจมันลอยขึ้นมาเหนือผิวน้ำ ให้เราได้กังวล ก็เป็นได้",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theMoon.png"),
    CardData(
        idCard: 20,
        cardName: "the Sun",
        detailCard:
            "ไพ่ใบนี้ในเรื่องความรักก็สดใส ซาบซ่าน ล่ะครับ ความสัมพันธ์เป็นความสัมพันธ์ที่มีความหวัง มีความมุ่งมั่น ธงสีแดงที่หมายถึงความปรารถนา ที่จะประสบผลสำเร็จและราบรื่นถ้าความสัมพันธ์ของคนสองคนที่ไม่เข้าใจกัน ทะเลาะกัน มีเรื่องขุ่นหมองใจ ไพ่ใบนี้จะปัดเป่าสิ่งเหล่านั้นไป ก็จะมีความเข้าใจกัน สิ่งที่ขุ่นมัวก็จะได้รับการแก้ไขสะสาง",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theSun.png"),
    CardData(
        idCard: 21,
        cardName: "Judgement",
        detailCard:
            "ในด้านความรัก ไพ่ใบนี้มักหมายถึง การตัดสินใจ ถึงเวลาที่คุณจะตัดสินใจเลือกแล้วว่า ความสัมพันธ์นี้ดีหรือไม่ดี มันโอเคมั้ย ถ้าไม่ก็อาจถึงเวลาที่ต้องตัดสินใจ การตัดสินใจก็ขึ้นอยู่กับคุณที่คุณจะประเมินล่ะครับแต่ทว่าแน่นอนไพ่ใบนี้มักจะมีการประกาศแจ้ง (ดังเช่นเสียงแตรในไพ่) จะมีการพูดคุยกัน จะมีการเคลียร์กัน ว่าอะไรดีไม่ดี สิ่งที่สะสมอยู่ในใจ สิ่งที่เก็บไว้สงสัยก็จะได้รับการเปิดเผย สะสาง เพื่อตัดสินใจที่จะอยู่ต่อหรือจากไป",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/judgement.png"),
    CardData(
        idCard: 22,
        cardName: "the World",
        detailCard:
            "ความหมายของไพ่ใบนี้คือความรักอันสมบูรณ์ เรียกได้ว่าไม่ได้มีอะไรหวือหวา ไม่ได้มีอะไรแปลกประหลาด พวกคุณสองคนรักกันดี ซึ่งแค่นี้ก็เพียงพอแล้วสำหรับความสัมพันธ์หากคุณกำลังคบๆดูใจกัน ไพ่นี้ก็เป็นไปในทางที่ดีเช่นกันว่า ทุกอย่างกำลังจะลงตัวจนถึงขั้นตกลงปลงใจเป็นแฟนกันได้... แต่ทว่า ไพ่ใบนี้ต้องดูองค์ประกอบให้ดีว่า ถ้าผู้ชายถามว่า ผู้หญิงคิดยังไงกับเรา หรือสถานการณ์เป็นยังไงแล้ว ไพ่ใบนี้แทนฝ่ายหญิงล่ะก็ อาจแปลได้ว่า ผู้หญิงคนนี้ ยังลัลล้า มีความสุขด้วยตัวคนเดียวได้อยู่ อาจจะยังไม่เลือกใครก็ได้ ซึ่งทั้งนี้ทั้งนั้นต้องดูไพ่ประกอบอื่นๆ",
        backCard: "assets/images/backCard.png",
        frontCard: "assets/images/theWorld.png")
  ];
